meeting/agenda/2023/11-07.org
:PROPERTIES:
:ID:       E19757A4-0811-4625-90E1-BEDB2E8B070F
:END:
#+title: QT4 CG Meeting 053 Agenda 2023-11-07
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/10-31.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
7 November,
the following meeting is scheduled for
14 November.

Any regrets for the following meeting?

** Review of open action items [1/2]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [X] QT4CG-052-01: MK to propose text for mutual promotion between xs:hexbinary and xs:base64Binary
+ [ ] QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-813][#813]]: 809 Move fn:atomic-equal to section 14.2
+ PR [[https://qt4cg.org/dashboard/#pr-807][#807]]: 789 Serialization terminology [editorial]
+ PR [[https://qt4cg.org/dashboard/#pr-806][#806]]: A few minor fixes for parse-uri
+ PR [[https://qt4cg.org/dashboard/#pr-804][#804]]: Minor edits, XQFO chh. 7, 8
+ PR [[https://qt4cg.org/dashboard/#pr-803][#803]]: 651: fn:log → fn:message
+ PR [[https://qt4cg.org/dashboard/#pr-802][#802]]: 801: non-deterministic → nondeterministic
+ PR [[https://qt4cg.org/dashboard/#pr-800][#800]]: 660: Static functions, default parameters, XPST0017
+ PR [[https://qt4cg.org/dashboard/#pr-797][#797]]: Edits to parse-uri()
+ PR [[https://qt4cg.org/dashboard/#pr-793][#793]]: 704: Context Value Expression → Context Value Reference
+ PR [[https://qt4cg.org/dashboard/#pr-792][#792]]: 783 XSLT: errors are raised
+ PR [[https://qt4cg.org/dashboard/#pr-790][#790]]: 129 XSLT40 and SER40 changes for context item -> value
+ PR [[https://qt4cg.org/dashboard/#pr-775][#775]]: 517: Reflected Christian Gruen's remarks

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/756][#756]]: JSON serialization - number formatting

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focussed
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-792][#792]]: 783 XSLT: errors are raised
+ PR [[https://qt4cg.org/dashboard/#pr-470][#470]]: 369: add fixed-prefixes attribute in XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-412][#412]]: 409, QT4CG-027-01: xsl:next-match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/742][#742]]: xsl:function-library: keep, drop, or refine?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/169][#169]]: Handling of duplicate keys in xsl:map
+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-815][#815]]: 130 Binary Promotion
+ PR [[https://qt4cg.org/dashboard/#pr-798][#798]]: 479: fn:deep-equal: Input order
+ PR [[https://qt4cg.org/dashboard/#pr-795][#795]]: 655: fn:sort-with
+ PR [[https://qt4cg.org/dashboard/#pr-794][#794]]: 216: fn:unparsed-text: End-of-line characters
+ PR [[https://qt4cg.org/dashboard/#pr-791][#791]]: 238: First draft of an fn:invisible-xml function
+ PR [[https://qt4cg.org/dashboard/#pr-772][#772]]: Revise the fn:parse-html rules to make them clearer to follow.
+ PR [[https://qt4cg.org/dashboard/#pr-761][#761]]: 554/754 Simplify the new transitive-closure function
+ PR [[https://qt4cg.org/dashboard/#pr-737][#737]]: 295: Boost the capability of recursive record types
+ PR [[https://qt4cg.org/dashboard/#pr-736][#736]]: 730: Clarify (and correct) rules for maps as instances of function types
+ PR [[https://qt4cg.org/dashboard/#pr-719][#719]]: 413: Spec for CSV-related functions
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528: revision of json(), and renaming to elements-to-maps()

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep or drop?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]]: fn:format-number: Specifying decimal format
+ Issue [[https://github.com/qt4cg/qtspecs/issues/260][#260]]: array:index-of
+ Issue [[https://github.com/qt4cg/qtspecs/issues/238][#238]]: Support Invisible XML
+ Issue [[https://github.com/qt4cg/qtspecs/issues/130][#130]]: New super/union type xs:binary?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/91][#91]]: name of map:substitute
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: json parsing number type option
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #719: 413: Spec for CSV-related functions
:PROPERTIES:
:CUSTOM_ID: h-45387788-D3B0-4E76-BE4A-8BE300A582D4
:END:

Matt will join us again this week. It would be nice to see some of
this work merged into the spec.

See PR [[https://qt4cg.org/dashboard/#pr-719][#719]]. 

** PR #772: Revise the fn:parse-html rules to make them clearer to follow.
:PROPERTIES:
:CUSTOM_ID: pr-772
:END:

See PR [[https://qt4cg.org/dashboard/#pr-772][#772]]

** PR #815: 130 Binary Promotion
:PROPERTIES:
:CUSTOM_ID: h-E31A227D-44AB-4D4A-94E8-E2807951C74D
:END:

See PR [[https://qt4cg.org/dashboard/#pr-815][#815]]

** PR #798: 479: fn:deep-equal: Input order
:PROPERTIES:
:CUSTOM_ID: h-867A0CC3-7FD5-4CC5-AC64-1CAE825BDB4A
:END:

See PR [[https://qt4cg.org/dashboard/#pr-798][#798]]

** PR #736: 730: Clarify (and correct) rules for maps as instances of function types
:PROPERTIES:
:CUSTOM_ID: h-D2E5A2FB-0A22-4C0D-A082-9C16FAD9331C
:END:

See PR [[https://qt4cg.org/dashboard/#pr-736][#736]]

** PR #791: 238: First draft of an fn:invisible-xml function
:PROPERTIES:
:CUSTOM_ID: h-0B39D210-D4BA-48A7-9A33-226397A5A6AB
:END:

See PR [[https://qt4cg.org/dashboard/#pr-791][#791]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
